0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.285;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1.285;
    }

    "(front|back)"
    {
        type            cyclic;
    }

    "(atmosphere|outlet)"
    {
        type            inletOutlet;
        inletValue      uniform 1.285;
        value           uniform 1.285;
    }

    "(walls|ground)"
    {
        type            kqRWallFunction;
        value           uniform 1.285;
    }

    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
