Allrun
#!/bin/bash
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
. ${WM_PROJECT_DIR:?}/bin/tools/CleanFunctions      # Tutorial clean functions
#------------------------------------------------------------------------------

runApplication blockMesh
runApplication topoSet
runApplication setFields
runApplication decomposePar
runParallel $(getApplication)
runApplication reconstructPar
