constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// porosity1
// {
//     type            explicitPorositySource;

//     explicitPorositySourceCoeffs
//     {
//         selectionMode   cellZone;
//         cellZone        canopyZone;

//         type            DarcyForchheimer;

//         d   (100 100 100);
//         f   (0 0 0);

//         coordinateSystem
//         {
//             type    cartesian;
//             origin  (0 0 0); 
//             coordinateRotation
//             {
//                 type    axesRotation;
//                 e1      (1 0 0);
//                 e2      (0 0 1);
//             }
//         }

//     }
// }

atmPlantCanopyUSource1
{
    type                  atmPlantCanopyUSource;

    atmPlantCanopyUSourceCoeffs
    {
        selectionMode   cellZone;
        cellZone        canopyZone;

    }

}


//************************************************************************* //
