system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters .1;

vertices
(
    (000 000 -48) // 0
    (192 000 -48) // 1
    (000 020 -48) // 2
    (192 020 -48) // 3
    (000 040 -48) // 4
    (192 040 -48) // 5
    (000 060 -48) // 6
    (192 060 -48) // 7

    (000 000 048) // 8
    (192 000 048) // 9
    (000 020 048) // 10
    (192 020 048) // 11
    (000 040 048) // 12
    (192 040 048) // 13
    (000 060 048) // 14
    (192 060 048) // 15

);

blocks
(
    hex (0 1 7 6 8 9 15 14) (48 15 24) simpleGrading (1 1 1)
    // hex (0 1 3 2 8 9 11 10) (100 20 1) simpleGrading (1 1 1)
    // hex (2 3 5 4 10 11 13 12) (100 20 1) simpleGrading (1 1 1)
    // hex (4 5 7 6 12 13 15 14) (100 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 6 14 8)
            // (2 4 12 10)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 7 15 9)            
            // (1 3 11 9)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (6 7 15 14)
        );
    }
    ground 
    {
        type wall;
        faces
        (
            (0 1 9 8)
        );
    }

    front
    {
        type cyclic;
        neighbourPatch back;
        faces
        (
            (8 9 15 14)
            // (10 11 13 12)
            // (12 13 15 14)
        );
    }

    back
    {
        type cyclic;
        neighbourPatch front;
        faces
        (
            (0 1 7 6)
            // (2 3 5 4)
            // (4 5 7 6)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
