system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
  {
    name    canopy;
    type    cellSet;
    action  new;
    source  boxToCell;
    sourceInfo
    {
      box (0 0 -4.8) (19.2 2 4.8);
    }
  }
    {
      name    canopyZone;
      type    cellZoneSet;
      action  new;
      source  setToCellZone;
      sourceInfo
      {
          set canopy;
      }
  }
);

// ************************************************************************* //

